{
  "lang_text": " : ",
  "lang_en": "อังกฤษ",
  "lang_th": "ไทย",
  "sidebar_name": "นายศิวกร แก้วมาลา",
  "sidebar_position": "Front-End Developer",
  "menu1": "เกี่ยวกับผม",
  "menu2": "ทักษะ Dev",
  "menu3": "ประสบการณ์",
  "menu4": "ผลงานของผม",

  "tabmenu1": "แนะนำตัว",
  "tabmenu2": "ประวัติโดยย่อ",
  "tabmenu3": "การศึกษา",

  "download": "ดาวน์โหลด",
  "graduate": "หนังสือรับรองจบการศึกษา",


  "title": "สวัสดีทุกท่าน, ผมชื่อศิวกร ",
  "subtitle": "Front End Developer",
  "welcome_message": "ความเรียบง่ายและความพึงพอใจของผู้ใช้งาน คือหัวใจหลักของการทำงานของผมเอง หลายโปรเจคทีมที่ผ่านมาผมได้ทำงานภายใต้แนวคิดแบบ Agile ที่เน้นการสื่อสารกับผู้เกี่ยวข้องทุกฝ่ายเพื่อตอบสนองผู้ใช้งานจริง ผมสนุกกับการแชร์ความรู้แก่เพื่อนร่วมทีมเสมอ เพราะผมเข้าใจแก่นแท้ของภาษา CSS  เป็นเหตุผลที่ทำให้ผมชำนาญใน Responsive Design รวมไปถึงหลักการ Javascript จากการทดลองเล่นเฟรมเวิร์คที่หลากหลายรูปแบบ ได้แก่ React, Next.js หรือ Vue.js แน่นอนว่ามีทักษะการ Debug จากทุกโปรเจคผ่านมา ผมเคยพัฒนาโปรเจคพื้นฐาน blockchain  และ NFT",
  "welcome_message_final" : "สุดท้ายนี้ ไม่ว่าท่านกำลังมองหา Front-end หรือ Software Developer ในระดับไหน ตัวผมก็มั่นใจในคุณสมบัติผมเองว่าสามารถตอบสนองต่อการผลิตซอฟแวร์ที่เหมาะสมที่สุดต่อธุรกิจของท่าน ขอขอบคุณและหวังว่าจะได้ร่วมงานกัน ",
  "my_portfolio" : "ผลงานของผม",

  "skill" : "ทักษะ Developer",
  "1y" : "1 ปี",
  "2y" : "2 ปี",
  "3y" : "3 ปี",
  "basic" : "มีพื้นฐาน",
  "expert" : "ชำนาญ",
  "2m" : "2 เดือน",
  "4m" : "4 เดือน",
  "6m" : "6 เดือน",
  "8m" : "8 เดือน",


  "p_title": "ข้อมูลส่วนตัว",
  "p_detail": "ขออนุญาติ เปิดเผยเป็นบางส่วน",
  "p1": "ชื่อจริง",
  "p2": "อายุ",
  "p3": "อีเมล",
  "p4": "เบอร์โทรติดต่อ",
  "p5": "ที่อยู่ปัจจุบัน",
  "p6": "สถานภาพทหาร",

  "a1": "นายศิวกร แก้วมาลา (ชื่อเล่น : เขม)",
  "a2": " ปี",
  "a5": "ขุนตาล, เชียงราย, ประเทศไทย",
  "a6": "ได้รับการยกเว้นไม่ต้องเข้ารับราชการ",

  "y1": "2563 - 2567",
  "y2": "2560 - 2563",
  "y3": "2557 - 2560",

  "edu1": "มหาวิทยาลัยเทคโนโลยีสุรนารี",
  "edu2": "โรงเรียนวิทยาศาสตร์จุฬาภรณราชวิทยาลัย เชียงราย",
  "edu3": "โรงเรียนเทิงวิทยาคม",

  "major1": "หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์",
  "major2": "หลักสูตรโรงเรียนวิทยาศาสตร์ภูมิภาค",
  "major3": "หลักสูตรวิทยาศาตร์ และคณิตศาตร์",

  "province1": "จังหวัดนครราชสีมา ประเทศไทย",
  "province2": "จังหวัดเชียงราย ประเทศไทย",
  "province3": "จังหวัดเชียงราย ประเทศไทย",

  "someting1": "สำเร็จการศึกษา เกียรตินิยมอันดับ 2 ด้วย 3.43 GPAX",
  "someting2": "สำเร็จการศึกษา ด้วย 3.38 GPAX",


  "exp_title": "ประสบการณ์การทำงาน",
  "exp1": "สหกิจศึกษา",
  "exp2": "นักศึกษาวิศวกรรมคอมพิวเตอร์",
  "exp3": "National Software Contest - NSC Thailand",
  "exp_time1": "พ.ย. 2566 - ก.พ. 2567",
  "exp_time2": "ก.ย. 2565 - ก.พ. 2565",
  "exp_time3": "ต.ค. 2561",
  "company1": "บริษัท ปูนซิเมนต์ไทย (ทุ่งสง) จํากัด",
  "company2": "ห้อง Software F11, สำนักวิศวกรรมคอมพิวเตอร์",
  "lo1": "จังหวัดนครศรีธรรมราช ประเทศไทย",
  "lo2": "จังหวัดนครราชสีมา ประเทศไทย",
  "lo3": "จังหวัดเชียงใหม่ ประเทศไทย",
  "des1": "รับตำแหน่ง Full Stack Developer ร่วมพัฒนากับทีม Organization เพื่อสร้างระบบข้อมูลโครงสร้างองค์กรและข้อมูลประวัติ เพื่อลดภาระการเขียนมือเพื่อคำนวณเงินเดือนพนักงาน",
  "des2": "Front-End Developer ระบบทุนการศึกษา และ ระบบจัดการผู้ป่วยใน",
  "des2_1": "พัฒนา Blockchain Mini Project ด้วย Solidity",
  "des2_2": "Artificial Intelligence : พิ้นฐาน DeepLearning Workshop",
  "des3": "เข้าร่วมประกวด พัฒนาเกม RPG 2 มิติ เพื่อตอบสนองความบันเทิงแก่ผู้เล่น โดยใช้ภาษา C# และ GameMaker engine",


  "warming": "ไม่สามารถเปิดเผยได้",

  "port_title": "ผลงานของผม",
  "port1": "ระบบจัดการผู้ป่วยใน",
  "port4": "ระบบ HRMS : Fairmanpower",
  "port_time1": "ม.ค. - ก.พ. 2566",
  "port_time2": "ส.ค. - ต.ค. 2566",
  "port_time3": "ต.ค. - พ.ย. 2566",
  "port_time4": "พ.ย. 2566 - ก.พ. 2567",
  "port_time5": "ต.ย. - พ.ย. 2566",
  "port_des1": "โปรเจค Software Engineering : ทีมผมได้ฝึกคิด requirement จากโรงพยาบาลเพื่อแก้ปัญหาให้ได้มากที่สุด และร่วมกับทีมพัฒนาด้วยภาษา Golang ใช้ Gin ในการติดต่อฐานข้อมูล SQLite เรียนรู้การทำ RESTful APIs เพื่อส่งข้อมูลไปยัง React interface ที่เขียนด้วย Typescript",
  "port_des2": "Music Player: Web Application ผมได้ทดลองฝึกทักษะการเขียน express.js ทำงานร่วมกับ React ด้วยเหตุผลที่อยากลองทำมิวสิคเพลย์เยอร์เป็นของตัวเองซักครั้ง สำหรับโปรเจคนี้ได้เรียนรู้การทำ RESTful APIs รวมไปถึงการจัดการ State ด้วย Redux toolkit",
  "port_des3": "โปรเจค Advanced Web Application : ผมมีไอเดียที่อยากลองสร้างระบบร้านขายรองเท้ากีฬา โดยพัฒนาด้วยภาษา Mongodb, Angular, และ Express.js ถือเป็นการฝึก MEAN STACK ไปในตัวรวมถึงจัดการ middleware และสร้าง LINE Chatbot สำหรับโต้ตอบลูกค้า",
  "port_des4": "เป็นระบบแก้ปัญหาภาระการเขียนมือเพื่อคำนวณเงินเดือนพนักงาน มาจัดการบนระบบเพื่อให้มองเห็นภาพรวมการวางแผนทรัพยาการบุคคลได้ดีขึ้นและมั่นใจในความถูกต้องของข้อมูลพนักงานและการจัดการบัญชีเงินเดือนภายในองค์กร",
  "port_des5": "เป็นฟีเจอร์เพิ่มเติมให้กับ Fideyourtracks เป็นส่วนที่ท้าทายผมมากที่สุดสำหรับการเรียนรู้ภาษา Solidity และ Ganache ผมเขียน Smart contract ERC-721 ไปใช้ในการ minting โดยใช้ Metamask ในการซื้อขาย เสียง NFT บน marketplace"

}
